{
  "backend/main.mo": "Marketplace canister defining product, user, cart, and order types plus access-controlled profile and product queries with category initialization.",
  "feature_evidence.json": "Feature evidence report linking a navigation Buy entry to Header.tsx with related components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend project files including components, pages, config, and assets.",
  "frontend/index.css": "Tailwind base/style variables defining light/dark themes with custom OKLCH color tokens and global resets.",
  "frontend/index.html": "HTML entry point loading main React bundle with Strager branding, icons, and manifest.",
  "frontend/public/.well-known/assetlinks.json": "Template Digital Asset Links file requiring package name and certificate fingerprint substitution.",
  "frontend/public/.well-known/assetlinks.README.txt": "Instructions for configuring Android Digital Asset Links for TWA including SHA-256 and package name setup.",
  "frontend/public/downloads/README.txt": "Guide for hosting APK and AAB files, naming conventions, download URLs, and version management.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining Strager app metadata, icons, theme colors, categories, and screenshots.",
  "frontend/public/offline.html": "Standalone offline fallback page with simple styling and retry button.",
  "frontend/public/sw.js": "Service worker that caches core assets, cleans old caches, and serves requests with network-first logic and offline fallbacks.",
  "frontend/src/App.tsx": "Defines the app layout and configures all React Router routes for pages like products, cart, checkout, and account.",
  "frontend/src/components/AuthGuard.tsx": "Protects routes by requiring authentication and shows a sign‑in prompt when the user is not logged in.",
  "frontend/src/components/Footer.tsx": "Renders the app footer with copyright text and a referral link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Main site header with logo, search bar, navigation, cart count, and authentication-aware actions.",
  "frontend/src/components/LocationStrip.tsx": "Shows the user’s saved delivery location and opens a dialog to update it.",
  "frontend/src/components/LoginButton.tsx": "Handles sign‑in and sign‑out using Internet Identity and updates cached queries accordingly.",
  "frontend/src/components/MobileHeaderAccountAction.tsx": "Mobile header button linking to orders when authenticated or home otherwise.",
  "frontend/src/components/ProductForm.tsx": "Form for creating or editing products with fields for name, description, price, stock, category, and image selection.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to submit display name, optional email, and seller status, saving the profile via mutation.",
  "frontend/src/components/PromoCard.tsx": "UI card component displaying a promo image with overlayed badge, title, and subtitle.",
  "frontend/src/components/PromoCarousel.tsx": "Renders promo cards in a mobile horizontal scroll or desktop grid using static promo data.",
  "frontend/src/components/QuickBenefitsRow.tsx": "Displays a horizontal list of four marketplace benefits with icons and labels.",
  "frontend/src/components/SettingsMenu.tsx": "Side sheet menu showing installation links (conditional) plus legal and support links based on user auth/profile state.",
  "frontend/src/components/UpdateLocationDialog.tsx": "Dialog allowing users to update and save their location to localStorage via an input field.",
  "frontend/src/content/brandCopy.ts": "Exports centralized brand text constants such as app name and search placeholders.",
  "frontend/src/hooks/useAabDownloadValidation.ts": "Validates AAB download URLs on change and exposes validation state and results.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useApkDownloadValidation.ts": "Validates APK download URLs on change and tracks loading and error status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status management.",
  "frontend/src/hooks/useLocalStorageState.ts": "Hook for reading and writing a string value to localStorage with state syncing.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, products, categories, cart actions, and order data using an actor backend.",
  "frontend/src/hooks/useScrollToAnchorOnRoute.ts": "Scrolls smoothly to a section based on the 'scrollTo' query parameter when the route changes.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, dark mode values, and common utility classes for layout and styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AabDownloadPage.tsx": "Page for generating, validating, and copying Android AAB download links with filename handling and notices.",
  "frontend/src/pages/AccountOrdersPage.tsx": "Displays the user's order history with status badges, loading skeletons, and AuthGuard protection.",
  "frontend/src/pages/ApkDownloadPage.tsx": "Page for generating, validating, and copying Android APK download links with security warnings and filename handling.",
  "frontend/src/pages/CartPage.tsx": "Shows and updates the user's cart with product details, quantity adjustments, and empty/loading states under AuthGuard.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays checkout form, validates shipping info, calculates subtotal, and submits order before redirecting to confirmation.",
  "frontend/src/pages/HomePage.tsx": "Shows homepage with location strip, promo carousel, categories, and featured products loaded from queries.",
  "frontend/src/pages/InstallAppPage.tsx": "Provides step‑by‑step instructions for installing the PWA on mobile devices and links to the packaging guide.",
  "frontend/src/pages/MobileAppPackagingGuidePage.tsx": "Guides users through PWA install, Android APK/AAB packaging, and iOS wrapper setup with copyable URLs.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Fetches and displays order confirmation details and shipping info after purchase, with links to view the order or continue shopping.",
  "frontend/src/pages/OrderDetailPage.tsx": "Loads and displays detailed order information including items, status, and product data, with navigation back to order history.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy page with sections describing data collection and usage. Uses cards and icons to present structured policy content.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed information for a single product, including images, pricing, stock, and add‑to‑cart functionality. Handles loading, errors, and authentication checks.",
  "frontend/src/pages/ProductsPage.tsx": "Shows all active products with search, category, and price filters. Fetches products and categories and renders filterable product listings.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Provides sellers with tools to manage their products, including creating, editing, and deactivating listings. Fetches the seller's products and wraps actions with dialogs and mutation hooks.",
  "frontend/src/pages/SupportContactPage.tsx": "Displays support and contact information including email, address, and FAQ-style sections. Uses cards and accordions to organize help content.",
  "frontend/src/pages/TermsOfServicePage.tsx": "React page rendering the Terms of Service with styled sections and icons using Cards and Tailwind classes.",
  "frontend/src/utils/aabValidation.ts": "Provides a function to validate whether a URL points to an accessible AAB file using HEAD/GET requests and content-type checks.",
  "frontend/src/utils/apkValidation.ts": "Implements URL validation for APK files via HEAD/GET requests and MIME-type inspection to confirm file authenticity.",
  "frontend/src/utils/clipboard.ts": "Utility for copying text to the clipboard with safe failure handling.",
  "frontend/src/utils/siteOrigin.ts": "Returns the site origin at runtime, returning null during SSR.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, shadows, and enabling plugins like typography and container queries.",
  "project_state.json": "Tracks project state, goals, architectural notes, issues, and implemented feature metadata for the marketplace app."
}