{
  "backend/main.mo": "Actor implementing marketplace state and logic including users, products, categories, carts, and orders with access control. Provides query and update methods for profiles and product listing.",
  "feature_evidence.json": "Feature evidence report mapping two APK/AAB-related features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file for documentation or planning.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark modes and global UI tokens.",
  "frontend/index.html": "HTML entry point setting up metadata, icons, manifest, and mounting root element for the React app.",
  "frontend/public/.well-known/assetlinks.json": "Placeholder Digital Asset Links file requiring real package name and SHA‑256 fingerprint for Android TWA.",
  "frontend/public/.well-known/assetlinks.README.txt": "Documentation explaining how to configure assetlinks.json for Android TWA verification and deployment.",
  "frontend/public/downloads/README.txt": "Developer guide for hosting APK/AAB files, naming conventions, default filenames, and download URL usage.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and Play Store screenshot assets.",
  "frontend/public/offline.html": "Standalone offline fallback page with styling and a retry button.",
  "frontend/public/sw.js": "Service worker implementing cache versioning, core asset caching, and network-first fetch handling with offline fallback.",
  "frontend/src/App.tsx": "Main app router setup defining layout and all route configurations for pages in the marketplace app.",
  "frontend/src/components/AuthGuard.tsx": "Wrapper component that blocks access for unauthenticated users and prompts sign‑in via Internet Identity.",
  "frontend/src/components/Footer.tsx": "Footer displaying navigation links, copyright, and a referral link with dynamic app identifier.",
  "frontend/src/components/Header.tsx": "Header with logo, search bar, navigation links, cart indicator, and mobile menu using authentication and cart data.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles sign‑in/sign‑out using Internet Identity and clears cached queries on logout.",
  "frontend/src/components/ProductForm.tsx": "React form component for creating or editing products, managing fields like name, description, price, stock, category, and image.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to set up their profile with name, email, and seller preference.",
  "frontend/src/hooks/useAabDownloadValidation.ts": "Hook that validates an AAB download URL and tracks validation status and results.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useApkDownloadValidation.ts": "Hook that validates an APK download URL and exposes validation state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, products, categories, cart, and related mutations using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS config defining color variables, dark mode styles, and utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity, and rendering the main App.",
  "frontend/src/pages/AabDownloadPage.tsx": "Provides an AAB download page that normalizes the filename, validates the download URL, and offers copy-to-clipboard link actions with UI alerts.",
  "frontend/src/pages/AccountOrdersPage.tsx": "Displays the user's order history with status badges and links to order details, handling loading and empty states.",
  "frontend/src/pages/ApkDownloadPage.tsx": "Shows an APK download page that ensures a valid filename, validates the file URL, and includes security warnings and copyable links.",
  "frontend/src/pages/CartPage.tsx": "Renders the user's shopping cart with product data, quantity updates, computed subtotal, and empty/loading handling.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout form, validating shipping info, summarizing the cart, and creating an order before redirecting to confirmation.",
  "frontend/src/pages/HomePage.tsx": "Home page with a hero section, featured products, and category browsing, loading product and category data dynamically.",
  "frontend/src/pages/InstallAppPage.tsx": "Provides step‑by‑step instructions for installing the PWA and links to the mobile app packaging guide.",
  "frontend/src/pages/MobileAppPackagingGuidePage.tsx": "Explains how to package the site as a mobile app and includes metadata, copy helpers, and external tool requirements.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays a confirmed order with basic details, shipping info, and navigation options after purchase.",
  "frontend/src/pages/OrderDetailPage.tsx": "Shows detailed order information, item breakdowns, product data lookup, and order status with guarded access.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy with sections on data handling and user information.",
  "frontend/src/pages/ProductDetailPage.tsx": "Loads and displays product details with add‑to‑cart functionality, authentication checks, and error handling.",
  "frontend/src/pages/ProductsPage.tsx": "Displays all products with search, category, and price filters using query hooks and UI components.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Provides seller tools to create, update, and deactivate products, showing only items belonging to the logged‑in seller.",
  "frontend/src/pages/SupportContactPage.tsx": "Shows support contact info, business address placeholders, and FAQs using cards and accordions.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Renders the Terms of Service with structured sections covering user responsibilities and platform rules.",
  "frontend/src/utils/aabValidation.ts": "Validates remote AAB file URLs via HEAD/GET requests and returns typed status results.",
  "frontend/src/utils/apkValidation.ts": "Validates APK file URLs similarly to AAB validation, checking availability and content type.",
  "frontend/src/utils/clipboard.ts": "Provides a helper to copy text to the clipboard with error handling.",
  "frontend/src/utils/siteOrigin.ts": "Returns the site's origin safely for client or server environments.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, plugins, and layout settings.",
  "project_state.json": "Tracks project version, goals, architectural notes, known issues, and implemented features for the e-commerce app."
}