{
  "backend/main.mo": "Motoko actor implementing marketplace logic with products, orders, user profiles, carts, categories, and access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report listing pages, components, and requirements linked to mobile app packaging and TWA guidance updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including components, pages, hooks, styles, and manifest metadata.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark OKLCH color palettes and global styling tokens.",
  "frontend/index.html": "HTML entry point loading the app with favicon, manifest, theme color, and main script.",
  "frontend/public/.well-known/assetlinks.json": "Template Digital Asset Links file requiring replacement of package name and SHA‑256 fingerprint.",
  "frontend/public/.well-known/assetlinks.README.txt": "Documentation explaining how to configure Digital Asset Links for Trusted Web Activity setup.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining icons, theme colors, metadata, and Play Store screenshots.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient styling and reconnect prompt.",
  "frontend/public/sw.js": "Service worker that caches core assets, updates caches on install/activate, and handles fetches with network-first logic and offline fallbacks.",
  "frontend/src/App.tsx": "Sets up the application's layout and client-side routing using TanStack Router and wraps the app in theme and toaster providers.",
  "frontend/src/components/AuthGuard.tsx": "Protects routes by checking authentication and shows a login prompt when the user is not signed in.",
  "frontend/src/components/Footer.tsx": "Displays footer links, branding, and attribution with dynamic year and referral link handling.",
  "frontend/src/components/Header.tsx": "Renders the main navigation bar with logo, search, cart, auth controls, and responsive mobile menu.",
  "frontend/src/components/LoginButton.tsx": "Handles login and logout actions via Internet Identity with UI feedback and query cache clearing.",
  "frontend/src/components/ProductForm.tsx": "Form for creating or editing products, managing state for fields like name, description, price, stock, category, and image.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A modal form prompting new authenticated users to enter name, email, and seller status, then saving the profile via a mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, products, categories, cart actions, and other backend interactions using the actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, typography, and common layout utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AccountOrdersPage.tsx": "Displays the authenticated user's order history with loading skeletons and order cards, wrapped in an AuthGuard.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, merges products with cart items, allows quantity updates, and shows subtotal with navigation to continue shopping.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows a checkout form, validates shipping details, calculates totals, and submits an order before redirecting to confirmation.",
  "frontend/src/pages/HomePage.tsx": "Renders a homepage with hero content, featured products, and category browsing sourced from product and category queries.",
  "frontend/src/pages/InstallAppPage.tsx": "Provides step-by-step instructions for installing the PWA on mobile devices and links to the packaging guide.",
  "frontend/src/pages/MobileAppPackagingGuidePage.tsx": "Explains how to package the site as a mobile app, includes metadata fields, and supports copying configuration values.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Loads and displays order confirmation details, including shipping info and links to order details or further shopping.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays detailed information for a specific order, including items, status, and product details, with loading and error handling.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the application's privacy policy content using styled cards and sections.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information with add-to-cart functionality, handling loading, authentication, and errors.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all active products with search, category, and price filtering, using client-side filtering logic.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Provides sellers with tools to manage their products, including creating, editing, and deactivating listings.",
  "frontend/src/pages/SupportContactPage.tsx": "Renders the Support & Contact page with email support, business address placeholders, and safety reporting info using cards and icons.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Displays the Terms of Service with sections outlining user agreements, account requirements, and policy details using card components.",
  "frontend/src/utils/clipboard.ts": "Provides an async helper to copy text to the clipboard with graceful failure handling.",
  "frontend/src/utils/siteOrigin.ts": "Returns the current site origin, falling back to a default domain during SSR.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, shadows, and enabling plugins like typography and container queries.",
  "project_state.json": "Metadata describing project status, requirements, architecture notes, and implemented features for the marketplace app."
}